Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_audio (InputLayer)     [(1, 320)]                0         
_________________________________________________________________
speech_features (SpeechFeatu (1, 1, 20)                640       
_________________________________________________________________
tf_op_layer_ExpandDims (Tens (1, 1, 20, 1)             0         
_________________________________________________________________
stream (Stream)              (1, 1, 18, 16)            220       
_________________________________________________________________
stream_1 (Stream)            (1, 1, 16, 16)            5296      
_________________________________________________________________
reshape (Reshape)            (1, 1, 256)               0         
_________________________________________________________________
gru_1 (GRU)                  (1, 1, 256)               395008    
_________________________________________________________________
stream_2 (Stream)            (1, 256)                  256       
_________________________________________________________________
dropout (Dropout)            (1, 256)                  0         
_________________________________________________________________
dense (Dense)                (1, 128)                  32896     
_________________________________________________________________
dense_1 (Dense)              (1, 256)                  33024     
_________________________________________________________________
dense_2 (Dense)              (1, 12)                   3084      
=================================================================
Total params: 470,424
Trainable params: 467,772
Non-trainable params: 2,652
_________________________________________________________________