Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(1, 24000)]              0         
_________________________________________________________________
speech_features (SpeechFeatu (1, 74, 20)               0         
_________________________________________________________________
tf_op_layer_ExpandDims (Tens [(1, 74, 20, 1)]          0         
_________________________________________________________________
stream (Stream)              (1, 72, 18, 16)           160       
_________________________________________________________________
stream_1 (Stream)            (1, 68, 16, 16)           3856      
_________________________________________________________________
reshape (Reshape)            (1, 68, 256)              0         
_________________________________________________________________
gru (GRU)                    (1, 1, 256)               394752    
_________________________________________________________________
stream_2 (Stream)            (1, 256)                  0         
_________________________________________________________________
dropout (Dropout)            (1, 256)                  0         
_________________________________________________________________
dense (Dense)                (1, 128)                  32896     
_________________________________________________________________
dense_1 (Dense)              (1, 256)                  33024     
_________________________________________________________________
dense_2 (Dense)              (1, 12)                   3084      
=================================================================
Total params: 467,772
Trainable params: 467,772
Non-trainable params: 0
_________________________________________________________________